/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sukwon <sukwon@student.hive.fi>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/11/10 15:44:59 by sukwon            #+#    #+#             */
/*   Updated: 2022/11/11 14:29:32 by sukwon           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_striteri(char *s, void (*f)(unsigned int, char *))
{
	size_t	i;
	size_t	n;

	if (!s || !f)
		return ;
	i = 0;
	n = ft_strlen(s);
	while (n--)
	{
		(f)(i, s);
		i++;
		s++;
	}
	*s = '\0';
}
// if (!s || !f)
// 		return ;

// 이거 위치 맨위로 안바꿔줬다고 protect가 안되더라..뭘까...진짜 하나하나 차근차근 배열해줘야지...안그러면.. 뭔가 에러생기는듯